#include <iostream>
using namespace std;

int main(){
   int matrix[5][5] = {
    {76, 2, 5, 19, 24},
    {3, 92, 0, 3, 4},
    {32, 48, 32, 16, 47},
    {1, 10, 64, 74, 84},
    {99, 88, 77, 66, 55}
}; 
    //x % y вычисляет остаток от деления на y
    //чтобы проверить на четность  - вычислим остаток от деления на 2
    //если остаток от деления=0, то число четное. Иначе нечетное 
    
    //вывод массива на экран
    for (int i = 0; i < 5; i++){
        if (i % 2 == 0){
            for (int j = 0; j < 5; j++){
                cout << matrix[i][j] << ", ";
            } 
        } else {
            for (int j = 5-1; j >= 0; j--){
                cout << matrix[i][j] << ", ";
            } 
        }
        cout << endl;
    }
    return 0;
}